[
  {
    "path": "science/2022-03-11-ratesofreactionpost/",
    "title": "Rate of reaction chemistry practical - monitoring a change in turbidity",
    "description": "The lesson starts with a worked example to introduce the R code needed to draw a graph of the mean time for the cross to disappear against the concentratrion of sodium thiosulphate and then allows the student to reproduce the graph using their own data",
    "author": [],
    "date": "2022-03-11",
    "categories": [],
    "contents": "\r\n\r\nDownload .Rmd here\r\nDownload word document here\r\nDownload pdf here\r\n\r\nGCSE: Chemistry Practical: Rates of Reaction Part 2 Observing a colour change\r\nLesson objectives\r\nTo draw a graph in R of mean time for cross to disappear against concentration of sodium thiosulphate\r\nTo use the graph to interpret your results\r\nPackages used in this lesson:\r\ntidyverse\r\nSuccess criteria\r\nI can use R to calculate means\r\nI can plot a line graph using R code\r\nKeywords\r\nmean rate of reaction\r\ngeom_point\r\ngeom_line\r\nylab\r\nxlab\r\nggtitle\r\nWorked Example\r\nThis is a worked example for you to follow.\r\nThis is how to calculate the mean time taken for the cross to disappear in seconds for each concentration of sodium thiosulphate.\r\nR is being told that when the concentration is 8 g/dm3, the times in each experiment for the cross to disappear in seconds was 810,545, 756, 720, 736. R stores these times in a variable called c8 and then finds the mean of the times in c8. This is repeated for each concentration of sodium thiosulphate used.\r\nClick on the little arrow on the left of the code chunk to run the code. Check R has calculated the means.\r\n\r\n\r\nc8 <- c(810, 545, 756, 720, 736)\r\nmean(c8)\r\n\r\n\r\n[1] 713.4\r\n\r\nc16 <- c(219, 229, 325, 210, 229)\r\nmean(c16)\r\n\r\n\r\n[1] 242.4\r\n\r\nc24 <- c(127, 198, 146, 135)\r\nmean(c24)\r\n\r\n\r\n[1] 151.5\r\n\r\nc32 <- c(97, 99, 109, 80, 140)\r\nmean(c32)\r\n\r\n\r\n[1] 105\r\n\r\nc40<- c(60, 66, 70, 62)\r\nmean(c40)\r\n\r\n\r\n[1] 64.5\r\n\r\nNow we will plot a graph of the mean times calculated above for the cross to disappear (in seconds) against concentration of sodium thiosulfate (g/dm^3)\r\nThe code in chunk2 tells R to use the concentrations on the x axis and the mean times on the y axis. Draw a table (called mydata) with the values of x and y in and then plot the points on a graph, draw a line between the points and label the x and y axis. Finally give the graph a title.\r\nClick on the little arrow on the right of the code chunk. Has R produced a graph? Knit your document and check the output file.\r\n\r\n\r\nx <- c(8,16,24,32,40)\r\ny <- c(mean(c8), mean(c16), mean(c24), mean(c32), mean(c40))\r\n\r\nmydata <- tibble(x, y)\r\n\r\nggplot (mydata, aes(x,y)) +\r\n  geom_point () +\r\n  geom_line() +\r\n  ylab (\"Time for cross to disappear (seconds)\") +\r\n  xlab (\"Concentration of sodium thiosulphate (g/dm3)\") +\r\n  ggtitle (\"Rate of reaction\")\r\n\r\n\r\n\r\n\r\nActivity:\r\nNow you are going to plot a graph using the data that you collected from your experiment.\r\nFirst calculate the mean time taken for the cross to disappear for each concentration of sodium thiosulphate.\r\nUse code chunk1 from the example above to help you but remember to replace the example times with your own data.\r\nRun your code to check the means.\r\n\r\n\r\n\r\nNow using the calculated means, plot a graph of mean time taken for cross to disappear (in seconds)on the y axis and concentration of sodium thiosulphate (g/dm^3) on the x axis. Use code chunk2 from the example above to help you.\r\n\r\n\r\n\r\nAnswer the following questions\r\n\r\nQ1 Describe how concentration affects the rate of reaction\r\nQ2 Explain your answer to Q1 by referring to the shape of your graph\r\nQ3 If the rate of reaction doubled, what would happen to the time taken for the cross to disappear\r\nQ4 Describe a possible source of error\r\nQ5 Suggest a way of reducing the error\r\nQ6 How do you use R to calculate the mean?\r\nQ7 How do you use R to write the title?\r\n\r\nWrite your answers below\r\nNOW KNIT THE DOCUMENT for the final time. This is the version of your work that your teacher will mark.\r\nTHE END\r\n\r\nLicense and Citation: You can use, modify, and adapt any of the lessons, but please include the following attribution: RGirls Community. (2022, April 10). RGirls Lessons. Zenodo. https://doi.org/10.5281/zenodo.6436861\r\n\r\n\r\n\r\n\r\n",
    "preview": "science/2022-03-11-ratesofreactionpost/ratesofreactionpost_files/figure-html5/chunk2-1.png",
    "last_modified": "2022-05-07T11:07:49-05:00",
    "input_file": {}
  }
]
