[
  {
    "path": "blog/2023-07-06-ammaarah/",
    "title": "Planting the Seeds of Empowerment with R for Girls",
    "description": {},
    "author": [
      {
        "name": "Ammaarah Jeewa",
        "url": {}
      }
    ],
    "date": "2023-07-06",
    "categories": [],
    "contents": "\r\n\r\nIn 2022, NHS-R Community founder Professor Mohammed A Mohammed (University of Bradford and the Strategy Unit) came up with the idea of introducing the joy of R to an audience far beyond the usual reach of data science: girls at secondary school. The goal was not to teach R as a programming language – because the term ‘computer science’ is often met with class-wide groans – but instead to use R to support the teaching and learning of maths, science, geography and other subjects across the curriculum. If successful, this would provide an entry point for data science using R – a much needed enabler to include women in data science.\r\nSo after much planning and testing, (and more planning and testing), this intrepid innovation was introduced to the classroom, and the results?\r\nWell, as one student said, I never knew data could be this fun!\r\n\r\n\r\nBudding Potential: Empowering Girls in Data Science\r\nWe designed R-Girls to be set up as a worldwide network to promote the use of R – a data science programming language – in secondary schools for girls. The lack of women in science and engineering (STEM, including data science) fields is an ongoing issue, and at R-Girls, it is our hope that we can help to change that, particularly for girls of lower socio-economic and ethnically diverse backgrounds.\r\nInspired by the success of a similar undertaking, the NHS-R Community, Mohammed joined forces with Greek Oak Academy’s headteacher Dr Razia Ghani, who has a background in statistical programming, to lay the groundwork for a new wave of learning that would allow its students to learn a modern, dare we even say, ‘cool’ skill that they could carry with them for life. This early introduction and exposure to data science would allow them to explore it as a potential career option. After all, in this data-driven world, there’s always room for one more data scientist.\r\nPlanting the Seeds: Key Decision Factors\r\nOne of the key motivators for Mohammed was to ‘impart the joy of learning R’ – spoken like a true educationalist! As professionals, he and Dr Ghani knew introducing R at a secondary educational stage held immense uncertainty along with immense value. Allowing the girls to get to grips with the coding world in a safe and familiar environment could only set them up for future success. And with R being open-source and free, it made it the perfect choice of educational software: easily accessible, with numerous resources, allowing the girls to access it not just within school premises, but at home and beyond, too.\r\nHowever. Getting secondary school girls to understand why they now had another lesson on their already packed timetable was a different story entirely.\r\nWhich is why, in order to make this transition as easy and low-key as possible, we chose to include R within existing STEM subject lessons – ie. maths, science and geography – rather than introducing it as a separate lesson. In doing this, our hope was to ease the resistance to learning something as dry-sounding as ‘computer science’. Instead, the girls were taught how R could help them with their current work especially where this involved collecting and analysing data and producing graphs in a fun way. This decision also prompted us to use R Markdown from the outset as we wanted the girls to understand how data and report writing went hand in hand.\r\nNavigating the Terrain: Challenges and Hurdles\r\nAs with every undertaking, there are hurdles to work through, and the first hurdle was funding.\r\nWith bated breath, Mohammed and Dr Ghani submitted a funding bid to the R Consortium and were delighted to receive seed funding to start the project at Green Oak Academy, a small, independent inner-city school in Birmingham UK.\r\nMohammed knew from his time using R that while it was possible to download R onto each computer individually, installation was…challenging. The thought of trying to talk a classful of secondary students through installing software, navigating privileges, grappling with operating systems and keeping on top of update packages would shake even the staunchest of tech pros. So we knew we had to use a cloud based solution… and Posit Cloud (formerly RStudio Cloud) came to the rescue.\r\nSo we had secured some funds, we had cloud access to R, but now for the final hurdle: none of the teachers knew what R was.\r\nAnd, as teachers are overworked and time-poor, it was imperative that we had to make this new learning opportunity as easy as possible for them. Which is why, over the course of 6 weeks – an entire summer holiday, in fact – we designed 10 oven-ready lessons for teachers to use.\r\nDeveloped with the aid of STEM subject teachers, these lessons mapped out fundamental concepts, such as how to draw a straight line graph, and data interpretation from science experiments.\r\nThese lessons were then pilot tested with a few teachers in a two hour training session. The teachers’ feedback was taken on board and key refinements were made. This cycle of feedback and revision resulted in speedy, refined improvements that allowed R Girls to move onto the next stage relatively quickly: pilot trials.\r\nBudding Potential: Pilot Trials\r\nWith our teachers trained up and the tech in place, it was time to begin the live trials.\r\nHolding our breath, we started with two introductory lessons to allow the girls to acclimatise to R-markdown and R, and then moved them onto more structured tasks.\r\nOur teachers were also brought into these pilot lessons as classroom assistants to allow them to adjust to the flow of the lesson, observe the situation and gain an understanding of how things would work without putting them under the pressure of having to lead. (Trying to attend to seven different calls of ‘Miss, I’ve forgotten my password!’ while delivering a coding lesson is no easy feat!)\r\nIn order to have a similar feedback cycle, after each lesson, we asked the girls to reflect on the lesson and write down what went well and what could be improved, fully expecting a list of complaints and objections. Instead, we received this.\r\n\r\n\r\n\r\nLessons in Full Bloom: Reception to R in the Classroom\r\nReassured by the unexpected but very welcome enthusiasm from the girls, we began to roll out the lessons in full force to the whole school, and the results have been equally overwhelmingly positive.\r\nThe girls learnt how to produce graphs, do calculations and write reports. We regularly share their feedback on our Twitter channel @R_Girls_School, typos included. 😉\r\nThe teachers have become increasingly interested, too. We now have three teachers who are confident enough to deliver R lessons, and our science teacher has taken the initiative to plan a series on building your own website in R which we’re excited to share this summer. We even have the English teachers wanting in on it!\r\nWe have also now come to the point where these R lessons are now officially timetabled into the school’s curriculum, which is a huge step towards putting R into the curriculum.\r\nBranching Out: The Ripple Effects\r\nIn the 24 months since R Girls began, we’ve made more progress than we’ve ever dreamed.\r\nIn 2022, our headteacher Dr Ghani gave two talks at high profile conferences, EARL2022 and NHS-R2022. The feedback from the audience was overwhelmingly positive, with many people saying the talks were inspirational.\r\nAccording to fellow network R Ladies, there was quite a crowd around Dr Ghani at the coffee table after, keen to offer ideas and help!\r\n\r\n\r\n\r\nWe’ve had some wonderful guest speakers come to Green Oak Academy to deliver R lessons, women who are involved in R themselves. These include Dr Batool Almarzouq who came all the way from Saudi Arabia to deliver a lesson on mapping. Dr Jenny Sloane from Australia became a key contributor, delivering a video series on how to create a website in R, while also creating R Girls’ very own website, and also came to deliver a lesson on plotting rainfall data from Australian cities.\r\nAnd from the NHS Strategy Unit, Analytics Manager Justine Wiltshire was inspired by our presentation at NHS-R and went to her local primary school’s STEM day to talk about data science! When we then invited her to come and cheer on our girls as they made their websites, she was thrilled and we are looking forward to her visit.\r\n\r\n\r\n\r\nAnd as if that wasn’t enough, we were voted as Charity of the Year at the industry R conference (EARL 2022) - a great honour.\r\nGrowing Together: Future Plans and Funding\r\nFrom a tiny seed of an idea, R-Girls has unfurled into something bigger than we could have ever imagined. We’ve spoken at major conferences, connected with incredibly talented and influential women, and begun to instil the love of R into a new generation of young women with flourishing results.\r\nBut R-Girls has not been an isolated effort. Everything we’ve achieved so far has been through the help of so many supporters, from the teaching staff at Green Oak Academy, to key funders such as RConsortium, Ascent.io, Posit and kind volunteers and supporters from R-Ladies who want to remain anonymous who have simply seen our endeavour as worthwhile and have wanted to help.\r\nWhile we now have a library of ten, ready to go lessons for all to use (no prior R knowledge required!), we’ve only begun to scratch the surface of what R can do. It is our goal to create a comprehensive library of these lessons, making the introduction of R into other secondary schools as easy as 1,2,3.\r\nBut in order to achieve this we need support. We need continued access to Posit Cloud, a cornerstone of our project. And that’s not all. Our modest IT suite is in desperate need of an upgrade and we’ve now reached the point where we need additional staff to manage R-Girls, and make more lessons!\r\nWe’d also love to be able to introduce the girls to more role models by inviting other guest visitors. Most of all, we need help to reach out to girl’s schools all over the world.\r\nThese are just some of the ways you can help. We are always looking for donations or you could order a R-Girls mug. Just drop an email to rgirlsschool@gmail.com.\r\n\r\n\r\n\r\nAll of us at R-Girls are looking forward to stretching out our branches even further. We still have plenty of ground to cover to reach our goal of including secondary school girls within the vast and ever-growing world of data science, but we can’t wait to see what we can achieve in 2023+!\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2023-07-06T16:24:14-04:00",
    "input_file": {}
  },
  {
    "path": "blog/2022-05-30-jennyrainfall/",
    "title": "Plotting Average Rainfall in Australia with R-Girls",
    "description": {},
    "author": [
      {
        "name": "Jenny Sloane",
        "url": {}
      }
    ],
    "date": "2022-05-30",
    "categories": [],
    "contents": "\r\n\r\nWhat is R-Girls?\r\nThe R-Girls School Network, or R-Girls for short, is\r\nan organization to promote the use of R in secondary schools\r\nparticularly (but not exclusively) for girls. Their goal is to inspire\r\nteachers to incorporate R into their everyday lesson plans. By using R\r\nin the classroom, students will be introduced to the amazing world of\r\nprogramming from a young age and in a fun, interactive way.\r\nFor more information about this incredible organization, you can\r\ncheck out the\r\nR-Girls\r\nwebsite. There you will find many free lesson plans on a range of\r\ntopics including Math, Science, and Geography. These lessons are created\r\nfor everyone, regardless of whether you have years of coding experience\r\nor you’ve never heard of R before. If you are new to R there are plenty\r\ntutorials and resources available that will help get you started on your\r\nR journey.\r\nHow did I get involved with\r\nR-Girls?\r\nLike most opportunities these days, I found out about R-Girls through\r\nnetworking and social media (shout out and thank you to Jenny\r\nRichmond!).\r\n\r\n\r\n\r\nI love teaching R, especially to younger students. One of my goals is\r\nto share my knowledge and inspire students to want to learn to code.\r\nThis has translated into many blog articles and video tutorials covering\r\nan array of topics in R. I enjoy teaching all students, but am\r\nparticularly interested in mentoring girls as unfortunately, in today’s\r\nworld, there is still a stigma when it comes to girls and coding. I want\r\nto be a role model and show girls that coding can be fun and it’s not\r\njust for boys. So, when I saw this tweet, I was very excited and\r\ncouldn’t wait to see if and how I could get involved. After getting in\r\ntouch with the organizers and meeting some of the other members, I\r\nquickly realized how passionate everyone was to teach R, so I knew I fit\r\nin.\r\nHow have I contributed to\r\nR-Girls?\r\nBecause I have experience building websites in R, I offered to help\r\nbuild the\r\nR-Girls\r\nwebsite. I built the website in R using the distill\r\npackage. Now, this is still a work in progress, but it’s been such a fun\r\nand rewarding project.\r\nI have also recorded a couple of short\r\ntutorials\r\nto help teachers, who may have no programming experience, get\r\nstarted.\r\nI was inspired by the lessons that others in the community already\r\ncreated, so I decided to have a crack at designing my own lesson plan.\r\nUnderstanding the importance of learning about climate change combined\r\nwith the fact that I lived in Australia for 4 years, I designed a lesson\r\naround a data set on the average rainfall in major Australian cities\r\nover the past couple of decades.\r\nMeeting R-Girls\r\nR-Girls was founded by\r\nGreen\r\nOak Academy in the UK and I was kindly invited to visit the school\r\nand teach my lesson to some of the girls. I was excited to have the\r\nopportunity to teach students in years 8, 9, and 10. I couldn’t wait to\r\nmeet everyone and get started!\r\nStroop Task\r\nI come from a cognitive psychology background, so I thought it would\r\nbe fun to start the lesson off with a demonstration of the\r\nStroop\r\nTask The girls spent a few minutes going through this fun, mini\r\nexperiment where you see colored words (like RED and\r\nGREEN) and have to respond to the color of the word not\r\nthe meaning. We talked about reaction times and how people are often\r\nfaster at responding to congruent words (where the\r\ncolor and the meaning match) compared to incongruent\r\nwords (where the color and meaning do not match). The girls seemed to\r\nreally enjoy this task/game. In fact, one girl explained she wished they\r\ncould do “the game at the start of every lesson”.\r\nRainfall Lesson Plan\r\nOf course, we spent the majority of the time going through the R\r\nlesson plan, which can be found\r\nhere.\r\nThe lesson objectives include:\r\nLearning how to read in data to RStudio\r\nPracticing how to view and explore the data\r\nIdentifying the different variables in the dataset\r\nCreating a beautiful line graph in R using ggplot2\r\nInterpreting the plot to see how average rainfall has changed over\r\nthe last 20 years\r\nHere’s a quick glimpse of what the data looks like:\r\n\r\n\r\n\r\nrainfall <- read_csv(\"rainfall_clean.csv\")\r\n\r\nrainfall\r\n\r\n\r\n# A tibble: 112 × 3\r\n   city_name  year avg_rainfall\r\n   <chr>     <dbl>        <dbl>\r\n 1 Adelaide   2000        1.53 \r\n 2 Adelaide   2001        1.71 \r\n 3 Adelaide   2002        0.996\r\n 4 Adelaide   2003        1.49 \r\n 5 Adelaide   2004        1.41 \r\n 6 Adelaide   2005        1.61 \r\n 7 Adelaide   2006        0.757\r\n 8 Adelaide   2007        1.27 \r\n 9 Adelaide   2008        1.03 \r\n10 Adelaide   2009        1.34 \r\n# … with 102 more rows\r\n\r\nCheck out the final plot below! Notice that this was created in just\r\na few lines of code.\r\n\r\n\r\nrainfall_plot <- ggplot(rainfall, aes(x = year, y = avg_rainfall, color = city_name)) +\r\n  geom_line()\r\nrainfall_plot\r\n\r\n\r\n\r\n\r\nFinal Thoughts\r\nBeing part of the R-Girls community has been a wonderful experience -\r\nit is a warm, friendly, and incredibly collaborative environment. I have\r\nlearned so much from the other members and hopefully they can say the\r\nsame for me. This is a worldwide community project, so if you wish to\r\ncontribute please get in touch via\r\nSlack,\r\nTwitter\r\nor email.\r\nI’m so proud to be part of the R-Girls community and grateful for the\r\nopportunity to go and visit the R-Girls School in person! I had such a\r\nblast meeting and teaching the girls. The girls were very engaged in the\r\nlesson and we got a lot of positive feedback. I’ll end by sharing a\r\nwordcloud of the students’ feedback that I created using the R\r\nwordcloud and RColorBrewer packages (I also\r\nfollowed along to\r\nthis\r\nshort tutorial) 😄\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "blog/2022-05-30-jennyrainfall/jennyrainfall_files/figure-html5/unnamed-chunk-2-1.png",
    "last_modified": "2022-06-01T08:01:04-04:00",
    "input_file": {}
  },
  {
    "path": "blog/2022-05-30-nasrinmapping/",
    "title": "Creating Awesome Maps with the R-Girls Mapping Lesson",
    "description": {},
    "author": [
      {
        "name": "Nasrin F. Attar",
        "url": {}
      }
    ],
    "date": "2022-05-30",
    "categories": [],
    "contents": "\r\nMy name is Nasrin F. Attar. I have a Ph.D. in water resources\r\nengineering and I am currently working as a university lecturer at UUT\r\n(Urmia University of Technology) and guest professor at UU (Urmia\r\nUniversity) teaching lessons on “water resources engineering”, “water\r\nresources projects” and “water structures”.\r\nFor the water structure lesson, I teach my students about hydraulic\r\nstructures such as dams, weirs, spillways, etc. For dams, I ask each of\r\nmy students to consider a country and search for its dams. This year I\r\nused the R-Girls ready made Mapping lesson in my classroom. Students\r\nfound the dams on GoogleEarth and showed the dam types and their 3D\r\nlocation and then used R code which is currently posted on the RGirlsschool\r\nwebsite.\r\nIt is a fantastic, informative code used to teach school girls how to\r\nfind a place in the world by its longitude and latitude coordinates. As\r\nnot all the students were familiar with R, I gave them some tips to get\r\nstarted and then asked them to find the dam locations using R code. It\r\nwas nice to see how quickly all the students progressed with this task\r\nand see their enjoyment.\r\nR-Girls-Schools is a worldwide network to promote the use of R — a\r\nleading data science programming language — in secondary schools for\r\ngirls, founded by Green Oak Academy, Birmingham UK. This site consists\r\nof different coding examples for teen girls. It was a great experience\r\nfor me to use their ready made lessons in my teaching.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-05-30T20:45:01-04:00",
    "input_file": {}
  }
]
