[
  {
    "path": "blog/2022-05-30-jennyrainfall/",
    "title": "Plotting Average Rainfall in Australia with R-Girls",
    "description": {},
    "author": [
      {
        "name": "Jenny Sloane",
        "url": {}
      }
    ],
    "date": "2022-05-30",
    "categories": [],
    "contents": "\r\n\r\nWhat is R-Girls?\r\nThe R-Girls School Network, or R-Girls for short, is\r\nan organization to promote the use of R in secondary schools\r\nparticularly (but not exclusively) for girls. The goal of R-Girls is to\r\ninspire teachers to incorporate R into their everyday lesson plans. By\r\nusing R in the classroom, students will be introduced to the amazing\r\nworld of programming from a young age and in a fun, interactive way.\r\nFor more information about this incredible organization, you can\r\ncheck out the R-Girls\r\nwebsite. On the website, you’ll find many free lesson plans on a\r\nrange of topics like Math, Science, and Geography. These lessons are\r\ncreated for everyone, regardless of whether you have years of coding\r\nexperience or if you’ve never heard of R before. On the website, we also\r\nprovide information and tutorials to help you get started.\r\nHow did I get involved with\r\nR-Girls?\r\nLike most opportunities these days, I found out about R-Girls through\r\nnetworking and social media (shout out and thank you to Jenny\r\nRichmond!).\r\n\r\n\r\nIf you’ve read any of my previous blogs, you probably know that I\r\nlove teaching R, especially to younger students. Unfortunately, in\r\ntoday’s world there is still a stigma when it comes to girls and coding\r\n(and doing other STEM courses). Of course, I love teaching R to all\r\nstudents, but I am especially passionate about inspiring girls. I want\r\nto be a role model and show girls that coding can be fun and it’s not\r\njust for boys. So, when I saw this tweet, I was very excited and\r\ncouldn’t wait to see if and how I could get involved. After getting in\r\ntouch with the organizers and meeting some of the other members, I\r\nquickly realized how passionate everyone was to teach R, so I knew I fit\r\nin.\r\nHow have I contributed to\r\nR-Girls?\r\nBecause I have experience building websites in R, I offered to help\r\nbuild the R-Girls website. I built the website in R using the\r\ndistill package. Now, this is still a work in progress, but\r\nit’s been such a fun and rewarding project.\r\nI have also recorded a couple of short tutorials\r\nto help teachers, who may have no programming experience, get\r\nstarted.\r\nI was inspired by the lessons that others in the community already\r\ncreated, so I decided to have a crack at designing my own lesson plan.\r\nUnderstanding the importance of learning about climate change combined\r\nwith the fact that I lived in Australia for 4 years, I decided to design\r\na lesson around a data set on the average rainfall in major Australian\r\ncities over the past couple of decades.\r\nMeeting R-Girls\r\nR-Girls was founded by Green Oak Academy in the UK. I have been doing\r\na lot of traveling this past year and I happened to be in the UK for a\r\ncouple of months, so I was kindly invited to come and visit the school\r\nand teach my lesson to some of the girls.\r\nI had such a great day visiting the R-Girls School and teaching\r\nstudents in years 8, 9, and 10. I could tell that the girls were eager\r\nand excited to get started.\r\nStroop Task\r\nBecause I come from a cognitive psychology background, I thought it\r\nwould be fun to start the lesson off with a demonstration of the stroop\r\ntask. The girls spent a few minutes going through this fun, mini\r\nexperiment where you see colored words (like RED and\r\nGREEN) and have to respond to the color of the word not\r\nthe meaning. We talked about reaction times and how people are often\r\nfaster at responding to congruent words (where the\r\ncolor and the meaning match) compared to incongruent\r\nwords (where the color and meaning do not match). The girls seemed to\r\nreally enjoy this task/game. In fact, one girl explained she wished they\r\ncould do “the game at the start of every lesson”.\r\nRainfall Lesson Plan\r\nOf course, we spent the majority of the time going through the R\r\nlesson plan, which can be found here.\r\nHere’s a quick glimpse of what the data looks like:\r\n\r\n\r\n\r\nrainfall <- read_csv(\"rainfall_clean.csv\")\r\n\r\nrainfall\r\n\r\n\r\n# A tibble: 112 × 3\r\n   city_name  year avg_rainfall\r\n   <chr>     <dbl>        <dbl>\r\n 1 Adelaide   2000        1.53 \r\n 2 Adelaide   2001        1.71 \r\n 3 Adelaide   2002        0.996\r\n 4 Adelaide   2003        1.49 \r\n 5 Adelaide   2004        1.41 \r\n 6 Adelaide   2005        1.61 \r\n 7 Adelaide   2006        0.757\r\n 8 Adelaide   2007        1.27 \r\n 9 Adelaide   2008        1.03 \r\n10 Adelaide   2009        1.34 \r\n# … with 102 more rows\r\n\r\nThe lesson objectives include:\r\nLearning how to read in data to RStudio\r\nPracticing how to view and explore the data\r\nIdentifying the different variables in the dataset\r\nCreating a beautiful line graph in R using ggplot2\r\nInterpreting the plot to see how average rainfall has changed over\r\nthe last 20 years\r\nCheck out the final plot below! Notice that this was created in just\r\na few lines of code.\r\n\r\n\r\nrainfall_plot <- ggplot(rainfall, aes(x = year, y = avg_rainfall, color = city_name)) +\r\n  geom_line()\r\nrainfall_plot\r\n\r\n\r\n\r\n\r\nFinal Thoughts\r\nBeing part of the R-Girls community has been a wonderful experience -\r\nit is a warm, friendly, and incredibly collaborative environment. I have\r\nlearned so much from the other members and hopefully they can say the\r\nsame for me. This is a worldwide community project, so if you wish to\r\ncontribute please get in touch via Slack, twitter or email.\r\nI’m so proud to be part of the R-Girls community and grateful for the\r\nopportunity to go and visit the R-Girls School in person! I had such a\r\nblast meeting and teaching the girls. The girls seems to be very engaged\r\nin the lesson and we got a lot of positive feedback. I thought it would\r\nbe fun to take the girls’ feedback and create a wordcloud! So, I’ll end\r\nwith sharing the wordcloud that I created using the\r\nwordcloud and RColorBrewer packages in R (I\r\nalso followed along to this short\r\ntutorial) 😄\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "blog/2022-05-30-jennyrainfall/jennyrainfall_files/figure-html5/unnamed-chunk-2-1.png",
    "last_modified": "2022-05-30T20:43:18-04:00",
    "input_file": {}
  },
  {
    "path": "blog/2022-05-30-nasrinmapping/",
    "title": "Creating Awesome Maps with the R-Girls Mapping Lesson",
    "description": {},
    "author": [
      {
        "name": "Nasrin F. Attar",
        "url": {}
      }
    ],
    "date": "2022-05-30",
    "categories": [],
    "contents": "\r\nMy name is Nasrin F. Attar. I have a Ph.D. in water resources\r\nengineering and I am currently working as a university lecturer at UUT\r\n(Urmia University of Technology) and guest professor at UU (Urmia\r\nUniversity) teaching lessons on “water resources engineering”, “water\r\nresources projects” and “water structures”.\r\nFor the water structure lesson, I teach my students about hydraulic\r\nstructures such as dams, weirs, spillways, etc. For dams, I ask each of\r\nmy students to consider a country and search for its dams. This year I\r\nused the R-Girls ready made Mapping lesson in my classroom. Students\r\nfound the dams on GoogleEarth and showed the dam types and their 3D\r\nlocation and then used R code which is currently posted on the RGirlsschool\r\nwebsite.\r\nIt is a fantastic, informative code used to teach school girls how to\r\nfind a place in the world by its longitude and latitude coordinates. As\r\nnot all the students were familiar with R, I gave them some tips to get\r\nstarted and then asked them to find the dam locations using R code. It\r\nwas nice to see how quickly all the students progressed with this task\r\nand see their enjoyment.\r\nR-Girls-Schools is a worldwide network to promote the use of R — a\r\nleading data science programming language — in secondary schools for\r\ngirls, founded by Green Oak Academy, Birmingham UK. This site consists\r\nof different coding examples for teen girls. It was a great experience\r\nfor me to use their ready made lessons in my teaching.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-05-30T20:45:01-04:00",
    "input_file": {}
  }
]
