[
  {
    "path": "R/2022-02-26-introrrstudiopost/",
    "title": "Introduction to R and RStudio",
    "description": "This is a short introduction to R and RStudio video tutorial.",
    "author": [
      {
        "name": "Jenny Sloane",
        "url": {}
      }
    ],
    "date": "2022-02-26",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-02-26T17:42:10-05:00",
    "input_file": {}
  },
  {
    "path": "R/2022-02-26-markdown1post/",
    "title": "First R Markdown Lesson",
    "description": "An introduction to R using R Markdown aimed at secondary school students (age 11-16) and for complete novices.A complete lesson plan to introduce the R coding language using R Markdown to deliver instructions.",
    "author": [],
    "date": "2022-02-26",
    "categories": [],
    "contents": "\r\nDownload .Rmd here\r\nDownload word document here\r\nDownload pdf here\r\nIntroduction to R Markdown\r\nLesson Objectives\r\nTo become familiar with the layout of an R Markdown document To practice typing in the code chunk To produce an output file of my work using the ‘knit’ command\r\nSuccess Criteria:\r\nI can write my name on my R Markdown document I can write in the code chunk I can produce an output file of my work\r\nKeywords:\r\nR code chunk\r\nknit\r\nHow to write your name on your R Markdown document\r\nOn line 3, replace where it says ‘write your name here’ with your full name. Make sure you don’t delete or write over the speech marks.\r\nClick on the ‘knit’ command at the top of the pane. After a short wait you will see the output file of your work. Can you see your name on the output file?\r\nIf you can see your name, close the output file by clicking on X.\r\nIf you cannot see your name, drag the output file to the side so that you can see what you wrote in the Markdown file. Check you typed your name correctly. Check that there are speech marks around your name. Knit your Markdown document again. Has your name been printed? If so, close the output file by clicking on X.\r\nTyping in the code chunk\r\nWhen you write code in the code chunk, R will carry out the commands. Code chunks are named r chunk1, r chunk2 etc. You must write your code in the lines between the top row of and the bottom row of.\r\nWe will tell R to do a calculation for us. Type 10 + 2 into the code chunk. Click on the little arrow on the right of the code chunk to tell R to carry out the command.\r\n\r\n\r\n\r\nDid R give you the correct answer?\r\nNow you make up an addition sum and type it into code chunk2. Don’t forget to click on the arrow on the right to run your code.\r\n\r\n\r\n\r\nNow click on knit. Read through your output file to check that your sums are printed.\r\nExtension\r\nTry typing in some more calculations. Try a subtraction calculation or a multiplication calculation. (Use the symbol * for multiply). Type in code chunk3, chunk4 and chunk5 below.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nMystery code\r\nI wonder what this code tells R to do.\r\nCarefully copy and paste the following lines of code into code chunk 6. Run the code. What do you see?\r\nx <- seq(1,128,1) y <- sin((x / 128.0) * pi) n <- 7 color <- rainbow(n, s = 1, v = 1, start = 0, end = max(1, n - 1)/n, alpha = 1) plot(x, y, type=“n”, ylim = c(0,10)) for(i in 1:7) {lines(x, y+i, col=color[i], lwd = 15)}\r\n\r\n\r\n\r\nKNIT YOUR DOCUMENT for the final time. This will be the version of your work that your teacher will check.\r\nWell done! You have completed your first R lesson.\r\nTHE END\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-02-26T07:52:22-05:00",
    "input_file": {}
  },
  {
    "path": "R/2022-02-26-markdown2post/",
    "title": "Second R Markdown Lesson",
    "description": "This lesson follows on from ‘My First R Lesson using R Markdown’ where students were introduced to the layout of an R Markdown document. In this lesson we start to look at the R code itself and to identify the commands needed to draw a bar chart.",
    "author": [],
    "date": "2022-02-26",
    "categories": [],
    "contents": "\r\n\r\nDownload .Rmd here\r\nDownload word document here\r\nDownload pdf here\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nBefore we start the lesson, type your name where it says “write your name here” on line 3. Make sure you type between the speech marks.\r\nKnit the file. Can you see your name at the top of the output file? Close the output file by clicking on the X\r\nLesson Objectives\r\nTo become familiar with the layout of an R Markdown file To practice editing the R code To identify R commands needed to plot a bar chart To produce an output file of my work using the ‘knit’ command\r\nSuccess Criteria:\r\nI can identify free text in the Markdown file I can identify where to type the R code in the Markdown file I can use some R commands to plot a bar chart\r\nI can produce an output file of my work\r\nKeywords:\r\nR code chunk\r\nfree text\r\nknit\r\nvariable\r\nPractising editing the code in R Markdown\r\nWe are going to draw a bar chart showing the percentage of different blood groups in the UK population. Then we are going to practice writing the title and the labels to explain the bar chart. Finally, we are also going to practice changing the colour of the bars. After making each change, click on the ‘knit’ command at the top of the pane. After a short wait you will see the output file of your work. Check that the changes you made to the code have come out on the output file as you wanted them. eg You may have added a title for your bar chart in the code chunk in the R Markdown file, but perhaps the title has not been printed in the output file. Go back to the R Markdown file to check you put speech marks around it.\r\nOur data\r\nThis is the data we are going to use for the bar chart\r\nTable 1: Percentage of population with each blood group Now we will find out how to enter the data from the above table into R. Copy the following two lines of R code into chunk1 below. Make sure you paste the text between the top and bottom 3 back ticks. blood_group <- c(‘O’,‘A’,‘B’,‘AB’) pop_percentage <- c(44,42,10,4) The first line tells R to store these letters in a variable called blood_group The second line tells R to store the percentages in a variable called pop_percentage.\r\nBlood Group\r\nO\r\nA\r\nB\r\nAB\r\nPercentage of population\r\n44\r\n42\r\n10\r\n4\r\n\r\n\r\nFALSE\r\n\r\n\r\n[1] FALSE\r\n\r\nTo check what R has stored in the variable blood_group, type blood_group inside code chunk2 and select the arrow on the far right of the chunk. R will tell you what it has stored. It should be the four blood groups\r\n\r\n\r\nFALSE\r\n\r\n\r\n[1] FALSE\r\n\r\nNow check what R has stored in the variable pop_percentage by typing pop_percentage in code chunk3. Click on the arrow on the far right of the chunk. R will tell you what it has stored. It should be the four percentage numbers.\r\n\r\n\r\nFALSE\r\n\r\n\r\n[1] FALSE\r\n\r\nLet’s check the percentage numbers add up to 100. Copy sum(pop_percentage) into code chunk 4 and click on the little arrow on the right of the chunk. What number does R print for you? Is it 100?\r\n\r\n\r\nFALSE\r\n\r\n\r\n[1] FALSE\r\n\r\nNow we will save the blood group and percentages data in a table (known as a tibble in R) called ‘mydata’. This is so that the two variables can be combined into a single data table. Copy the following code into R chunk5. mydata <- tibble(blood_group, pop_percentage)\r\n\r\n\r\nFALSE\r\n\r\n\r\n[1] FALSE\r\n\r\nLets check that ‘mydata’ has the correct information in it. Type mydata into code chunk6 and then click on the arrow on the right. Does the computer show you a little table with the correct information in?\r\n\r\n\r\nFALSE\r\n\r\n\r\n[1] FALSE\r\n\r\nDrawing a bar chart using our blood group data\r\nNow we have entered the data and checked that the data is correct we can tell R to plot a bar chart using these data. Copy and paste the three lines of R code into chunk7 and click on the little arrow on the right. ggplot(mydata) + aes(x=blood_group, y=pop_percentage) + geom_bar(stat = ‘identity’)\r\nWhat does this code mean?\r\nggplot means ‘draw me a graph’\r\nmydata means ‘use the numbers in the mydata tibble’\r\naes is short for aesthetics and means ‘what I want to see is…’\r\nx=blood_group means ‘plot blood group on the x axis’\r\ny=pop_percentage means ‘plot percentage of people on the y axis’\r\ngeom_bar means ‘the graph I want is a bar chart’\r\nstat = ‘identity’ means ‘make the bars as tall as the y values in the tibble’\r\n\r\n\r\nFALSE\r\n\r\n\r\n[1] FALSE\r\n\r\nCheck your bar chart. Are the bars black?\r\nWriting labels and title\r\nNow lets alter the labels and add a title so that the bar chart is clearer. Copy and paste the following R code into chunk8 then click on the little arrow on the right. ggplot(mydata) + aes(x=blood_group, y=pop_percentage) + geom_bar(stat = ‘identity’)+ ylab(‘Percentage of the population’)+ xlab(‘Blood group’)+ ggtitle(‘UK Population Blood Groups’) You have added some more instructions for R. What do they mean? ylab(‘Percentage of the population’) means ‘make this the label for the y axis’ xlab(‘Blood group’) means ‘make this the label for the x axis’ ggtitle(‘UK Population Blood Groups’)means ‘make this the title for the barchart’ Note how there is a plus sign after each command\r\n\r\n\r\nFALSE\r\n\r\n\r\n[1] FALSE\r\n\r\nCheck your bar chart. Are the labels correct? Is the title correct? Are the bars still black? Well done!\r\nChanging the colour of the bars\r\nLet’s make it prettier. Let’s make the bars red.\r\nCopy and paste the R code below into chunk9 and click on the little arrow on the right ggplot(mydata) + aes(x=blood_group, y=pop_percentage) + geom_bar(stat = ‘identity’, fill = ‘red’)+ ylab(‘Percentage of the population’)+ xlab(‘Blood group’)+ ggtitle(‘UK Population Blood Groups’)\r\n\r\n\r\nFALSE\r\n\r\n\r\n[1] FALSE\r\n\r\nAre the bars red? Suggest what part of the code told R to make the bars red. Let’s make it even prettier. Copy and paste the following code into chunk10 ggplot(mydata) + aes(x=blood_group, y=pop_percentage, fill = blood_group) + geom_bar(stat = ‘identity’)+ ylab(‘Percentage of the population’)+ xlab(‘Blood group’)+ ggtitle(‘UK Population Blood Groups’)\r\n\r\n\r\nFALSE\r\n\r\n\r\n[1] FALSE\r\n\r\nWhat happened? Suggest what part of the code told R to colour the bars. How did R colour the bars? Well done! You have successfully completed your second R lesson. Now KNIT YOUR DOCUMENT for the final time. This is the version of your work that your teacher will mark.\r\nTHE END\r\n\r\n\r\n\r\n",
    "preview": "R/2022-02-26-markdown2post/markdown2_feedback.jpg",
    "last_modified": "2022-03-05T17:05:02-05:00",
    "input_file": {}
  }
]
